<!DOCTYPE html>
<html>
  <head>

    <title>Scholia</title>
<meta charset="UTF-8">
<meta name="robots" content="index, nofollow">

<meta name="og:url" content="https://scholia.toolforge.org/author/Q62852" />
<meta name="og:site_name" content="Scholia" />
<meta name="og:image" content="/static/images/scholia_social_media.png" />

<meta name="twitter:card" content="summary" />
<meta name="twitter:site" content="@WDScholia" />

    <!-- Bootstrap -->
    <link href="/static/css/bootstrap.min.css" rel="stylesheet">

<link rel="canonical" href="https://scholia.toolforge.org/author/Q62852">

<link rel="stylesheet" type="text/css" href="/static/css/bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="/static/jquery.dataTables.min.css">
<link rel="stylesheet" type="text/css" href="/static/css/scholia.css">
<!-- Generated with RealFaviconGenerator -->
<link rel="apple-touch-icon" sizes="180x180" href="/static/favicon/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/static/favicon/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/static/favicon/favicon-16x16.png">
<link rel="manifest" href="/static/favicon/site.webmanifest">
<link rel="mask-icon" href="/static/favicon/safari-pinned-tab.svg" color="#09af8a">
<link rel="shortcut icon" href="/static/favicon/favicon.ico">
<meta name="apple-mobile-web-app-title" content="Scholia">
<meta name="application-name" content="Scholia">
<meta name="msapplication-TileColor" content="#09af8a">
<meta name="theme-color" content="#09af8a">


  </head>
  <body>
    
<div class="navbar navbar-static-top">
    <ul class="nav nav-pills">
	<li role="presentation"><a href="/"><img src="/static/images/scholia_wordmark.svg" width="112px" height="24px" alt="Scholia"></a></li>
	<li role="presentation"><a href="/author/">Author</a></li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Work
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/work/">Work</a></li>
		    <li role="presentation"><a href="/venue/">Venue</a></li>
		    <li role="presentation"><a href="/series/">Series</a></li>
                    <li role="presentation"><a href="/catalogue/">Catalogue</a></li>
		    <li role="presentation"><a href="/publisher/">Publisher</a></li>
		    <li role="presentation"><a href="/printer/">Printer</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Organization
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/organization/">Organization</a></li>
		    <li role="presentation"><a href="/publisher/">Publisher</a></li>
		    <li role="presentation"><a href="/printer/">Printer</a></li>
		    <li role="presentation"><a href="/sponsor/">Sponsor</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Location
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/location/">Location</a></li>
		    <li role="presentation"><a href="/country/">Country</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Event
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/event/">Event</a></li>
		    <li role="presentation"><a href="/event-series/">Event series</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Project
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/clinical-trial/">Clinical trial</a></li>
		    <li role="presentation"><a href="/project/">Project</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation"><a href="/award/">Award</a></li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Topic
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/topic/">General</a></li>
		    <li role="presentation"><a href="/disease/">Disease</a></li>
		    <li role="presentation"><a href="/taxon/">Taxon</a></li>
		    <li role="presentation"><a href="/gene/">Gene</a></li>
		    <li role="presentation"><a href="/protein/">Protein</a></li>
		    <li role="presentation"><a href="/pathway/">Pathway</a></li>
		    <li role="presentation"><a href="/chemical/">Chemical</a></li>
		    <li role="presentation"><a href="/chemical-element/">Chemical element</a></li>
		    <li role="presentation"><a href="/chemical-class/">Chemical class</a></li>
		    <li role="presentation"><a href="/lexeme/">Lexeme</a></li>
		    <li role="presentation"><a href="/use/">Use</a></li>
		</ul>
	    </div>
	</li>
	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Tools
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/arxiv-to-quickstatements">Arxiv to Quickstatements</a></li>
		    <li role="presentation"><a href="/q-to-bibliography-templates">Q to Bibliography templates</a></li>
		    <li role="presentation"><a href="/text-to-topics">Text to topics</a></li>
		</ul>
	    </div>
	</li>

	<li role="presentation">
	    <div class="dropdown">
		<button class="btn btn-link dropdown-toggle" 
			type="button" data-toggle="dropdown">Help
		    <span class="caret"></span></button>
		<ul class="dropdown-menu">
		    <li role="presentation"><a href="/about">About</a></li>
		    <li role="presentation"><a href="/statistics">Statistics</a></li>
		    <li role="presentation"><a href="/faq">FAQ</a></li>
		</ul>
	    </div>
	</li>
    
    </ul>
    
    <div class='nav nav-search'>
	    <div class="input-group">
        <input type="text" id="searchterm"/>
        </div>
    </div>
    
</div>

    
<div class="content">
<div class="container">
    <span id="aspect-chooser"></span>
</div>
<div class="container">
    

<h1 id="h1">Author</h1>
<script type="application/ld+json" id="bioschemas"></script>

<div id="intro"></div>

<div id="wembedder"></div>

<div id="details"></div>

<h2 id="list-of-publications-header">List of publications <a href="/author/Q62852/latest-works/rss"><img height="24" width="48" src="/static/images/rss-40674_320.png" alt="RSS icon" /></a></h2>

<table class="table table-hover" id="list-of-publications-table"></table>


<!--      SourceMD does currently not work

div>


    Missing publications? 
    
    <a href="https://query.wikidata.org/#select%20%2a%20where%20%7B%20%3Fwork%20wdt%3AP2093%20%3Fauthorname%20.%20filter%28regex%28%3Fauthorname%2C%20%27%5ET.%2bNelson%24%27%29%29%20%7D%20limit%201">Search for unlinked works on Wikidata</a>
    or
    add new ones with <a href="https://sourcemd.toolforge.org/">sourcemd</a>.
    
    
</div -->


<h3 id="publications-per-year-header">Number of publications per year</h3>

<div class="embed-responsive embed-responsive-16by9">
    <iframe class="embed-responsive-item" id="publications-per-year-iframe"></iframe>
</div>


<h3 id="pages-per-year-header">Number of pages per year</h3>

(Only articles with number of pages set are displayed)

<div class="embed-responsive embed-responsive-16by9">
    <iframe class="embed-responsive-item" id="pages-per-year-iframe"></iframe>
</div>

<h2>Topics</h2>


<h3 id="topic-scores-header">Topic scores</h3>

Topics based on a weighting between fields of work,
topics of authored works and topics of citing works.  

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="topic-scores-iframe"></iframe>
</div>


<h3 id="topics-header">Topics of authored works</h3>

<table class="table table-hover" id="topics-table"></table>

<h3 id="Topics-works matrix">Topics-works matrix</h3>

<div id="topics-works-matrix"></div>


<h2 id="venue-statistics-header">Venue statistics</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="venue-statistics-chart-iframe"></iframe>
</div>

<table class="table table-hover" id="venue-statistics-table"></table>

<h2 id="review-statistics-header">Review statistics</h2>
<p>This author has reviewed for the following journals.</p>
<table class="table table-hover" id="review-statistics-table"></table>

<h2 id="coauthors-header" data-toogle="tooltip" title="Co-author graph for the author (up to 1000 links)">Co-author graph</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="coauthors-iframe"></iframe>
</div>

Are co-authors missing here? You can help curate them via the <a href="/author/Q62852/curation">curation</a> page.

<h2 id="coauthor-map-header">Co-author map</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="coauthor-map-iframe"></iframe>
</div>


<h2 id="other-locations-header">Other locations</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="other-locations-iframe"></iframe>
</div>


<h2 id="timeline-header">Timeline</h2>


<div class="embed-responsive embed-responsive-16by9">
    <iframe class="embed-responsive-item" id="timeline-iframe"></iframe>
</div>

<h2 id="academic-tree-header">Academic tree</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="academic-tree-iframe"></iframe>
</div>


<h2>Citation statistics</h2>

<h3 id="most-cited-works-header">Most cited works</h3>

Works of the author ordered according to number of citations received.

<table class="table table-hover" id="most-cited-works-table"></table>


<h3 id="citations-by-year-header">Citations by year</h3>

<div class="embed-responsive embed-responsive-16by9">
    <iframe class="embed-responsive-item" id="citations-by-year-iframe"></iframe>
</div>


<h3 id="most-citing-authors-header">Citing authors</h3>

Authors that cite the author (excluding self citations).

<table class="table table-hover" id="most-citing-authors-table"></table>

Are citing authors missing here? You can help curate them via the <a href="/author/Q62852/curation">curation</a> page.

<h2 id="associated-images-header">Associated images</h2>

<div class="embed-responsive embed-responsive-4by3">
    <iframe class="embed-responsive-item" id="associated-images-iframe"></iframe>
</div>


<h2 id="events-header">Events</h2>

Conferences, workshops and other events the author has attended or otherwise been associated with.

<table class="table table-hover table-striped" id="events-table"></table>


</div>
</div>
<div class="container footer">
    <hr>
    Data from <a href="https://www.wikidata.org">Wikidata</a> and
    <a href="https://en.wikipedia.org">English Wikipedia</a>
    |
    Code from
    <a href="https://github.com/WDscholia/scholia">GitHub repository</a>
    |
    Hosted on   <a href="https://toolforge.org/">Wikimedia Toolforge</a>,
    a <a href="https://wikimediafoundation.org">Wikimedia Foundation</a> service
    |
    License for content: CC0 for data, CC-BY-SA for text and media
    |
    Report technical problems at Scholia's
    <a href="https://github.com/WDscholia/scholia/issues">Issues</a> GitHub page.
    |
    Follow us on <a href="https://twitter.com/wdscholia">Twitter</a>.
    <hr>
  </div>


    

    <script src="/static/jquery.min.js"></script>
    <script src="/static/js/bootstrap.min.js"></script>

<script type="text/javascript" src="/static/d3.v5.min.js"></script>
<script type="text/javascript" src="/static/d3-scale-chromatic.v1.min.js"></script>
<script type="text/javascript" src="/static/jquery.dataTables.min.js"></script>
<script type="text/javascript" src="/static/scholia.js"></script>
<link href="/static/widgets/select2/css/select2.min.css" rel="stylesheet" />
<script type="text/javascript" src="/static/widgets/select2/js/select2.min.js"></script>

<script type="text/javascript">
    
    var url = 'https://www.wikidata.org/w/api.php?action=wbgetentities&ids=' +
	       'Q62852' + 
	       '&format=json&callback=?';
     
    $.getJSON(url, function (data) {
	 var item = data.entities["Q62852"];
	 if ('en' in item.labels) {
	     var title = item.labels.en.value
	     $("#h1").text(title);
       $("title").text(title + " - Scholia");

	     
	 }
	 $("#h1").append(' (<a href="https://www.wikidata.org/wiki/Q62852">Q62852</a>)');

    

	 var detailsList = Array();
	 try {
	     var orcid = item.claims.P496[0].mainsnak.datavalue.value;
	     detailsList.push( '<a href="https://orcid.org/"><img alt="' +
			       'ORCID logo" src="/static/images/orcid_16x16.gif"' +
			       'width="16" height="16" hspace="4" /></a> <a href="https://orcid.org/' +
			       encodeURI( orcid ) + '">https://orcid.org/' + escapeHTML( orcid ) + '</a>');
	 }
	 catch(e) {}

	 try {
	     var mastodonAccount = item.claims.P4033[0].mainsnak.datavalue.value;
	     var mastodonComponents = mastodonAccount.split("@");
	     if (mastodonComponents.length == 2) {
		 detailsList.push( '<img alt="Twitter t icon" src="' +
				   'https://upload.wikimedia.org/wikipedia/commons/4/48/Mastodon_Logotype_%28Simple%29.svg' +
				   '" width="16" height="16" hspace="4" /> <a href="https://' + mastodonComponents[1] + '/@' +
				   encodeURI( mastodonComponents[0] ) + '">@' + escapeHTML( mastodonComponents[0] ) + '</a> ');
	     }
	 }
	 catch(e) { }

	 try {
	     var twitterAccount = item.claims.P2002[0].mainsnak.datavalue.value;
	     detailsList.push( '<img alt="Twitter t icon" src="' +
			       'https://upload.wikimedia.org/wikipedia/commons/8/8b/Twitter_logo_initial.svg' +
			       '" width="16" height="16" hspace="4" /> <a href="https://twitter.com/' +
			       encodeURI( twitterAccount ) + '">@' + escapeHTML( twitterAccount ) + '</a> ');
	 }
	 catch(e) { }

	 try {
	     var rorID = item.claims.P6782[0].mainsnak.datavalue.value;
	     detailsList.push( 'ROR <a href="https://ror.org/' + encodeURI( rorID ) + '">' + rorID + '</a> ');
	 }
	 catch(e) { }

	 try {
	     var hashtag = item.claims.P2572[0].mainsnak.datavalue.value;
	     detailsList.push( '<a href="https://hashtags-hub.toolforge.org/' +
			       encodeURI( hashtag ) + '">#' + escapeHTML( hashtag ) + '</a> ');
	 }
	 catch(e) {}

	 try {
	     var doi = item.claims.P356[0].mainsnak.datavalue.value;
	     $("head").append( '<meta name="citation_doi" content="' + doi + '"/>' );
	 }
	 catch(e) {}

	 try {
	     $( '#details' ).append( detailsList.join( " | " ) );
	 }
	 catch(e) {}
	 
	 /* BioSchemas annotation */
	 if (item.claims.P31 &&
	     ((item.claims.P31[0].mainsnak.datavalue.value.id == 'Q5'))) {
	   try { /* Person */
	       bioschemasAnnotation = {
	          "@context" : "https://schema.org",
	          "@type" : "Person" ,
	          "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/Person/0.2-DRAFT-2019_07_19/" },
	          "description" : "A person" ,
	          "identifier" : "Q62852" ,
	          "mainEntityOfPage" : "http://www.wikidata.org/entity/Q62852"
	       }
	       if ('en' in item.labels) {
	         bioschemasAnnotation.name = item.labels.en.value;
	       }
	       $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
	    } catch(e) {}
	 } else if (item.claims.P31 &&
	     ((item.claims.P31[0].mainsnak.datavalue.value.id == 'Q47461491') ||
	      (item.claims.P31[0].mainsnak.datavalue.value.id == 'Q967847'))) {
	   try { /* ChemicalSubstance */
	       bioschemasAnnotation = {
	          "@context" : "https://schema.org",
	          "@type" : "ChemicalSubstance" ,
	          "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/ChemicalSubstance/0.4-RELEASE/" },
	          "identifier" : "Q62852" ,
	          "url" : "http://www.wikidata.org/entity/Q62852"
	       }
	       if ('en' in item.labels) {
	         bioschemasAnnotation.name = item.labels.en.value;
	       }
	       $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
	    } catch(e) {}
	 } else if (item.claims.P225) {
             try { /* Taxon */
		 var taxonName = item.claims.P225[0].mainsnak.datavalue.value;
		 bioschemasAnnotation = {
	             "@context" : "https://schema.org",
	             "@type" : "Taxon" ,
	             "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/Taxon/0.6-RELEASE/" },
	             "name" : taxonName ,
	             "url" : "http://www.wikidata.org/entity/Q62852"
		 }
		 if (item.claims.P105) {
	             var taxonRank = item.claims.P105[0].mainsnak.datavalue.value.id;
	             bioschemasAnnotation.taxonRank = "http://www.wikidata.org/entity/" + taxonRank ;
		 }
		 if (item.claims.P171) {
	             var parent = item.claims.P171[0].mainsnak.datavalue.value.id;
	             bioschemasAnnotation.parentTaxon = "http://www.wikidata.org/entity/" + parent ;
		 }
		 $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
		 // console.log(JSON.stringify(bioschemasAnnotation, "", 2))
	     } catch(e) {}
	 } else if (item.claims.P235) {
	     try { /* Chemical Compound */
		 var inchiKey = item.claims.P235[0].mainsnak.datavalue.value;
		 bioschemasAnnotation = {
	             "@context" : "https://schema.org",
	             "@type" : "MolecularEntity" ,
	             "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/MolecularEntity/0.5-RELEASE/" },
	             "identifier" : "Q62852" ,
	             "inChIKey" : inchiKey ,
	             "url" : "http://www.wikidata.org/entity/Q62852"
		 }
		 if ('en' in item.labels) {
	         bioschemasAnnotation.name = item.labels.en.value;
         }
		 if (item.claims.P234 && item.claims.P234[0].mainsnak.datavalue) {
	             var inchi = item.claims.P234[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.inChI = inchi ;
		 }
		 if (item.claims.P274 && item.claims.P274[0].mainsnak.datavalue) {
	             var chemformula = item.claims.P274[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.molecularFormula = chemformula ;
		 }
		 if (item.claims.P2017 && item.claims.P2017[0].mainsnak.datavalue) {
	             var smiles = item.claims.P2017[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.molecularFormula = smiles.replace("\"", "\'\'") ;
		 } else if (item.claims.P233 && item.claims.P233[0].mainsnak.datavalue) {
	             var smiles = item.claims.P233[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.smiles = smiles.replace("\"", "\'\'") ;
		 }
		 $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
	     } catch(e) { console.log("Exception: " + e)
	     }
	 } else if (item.claims.P352) { // UniProt ID
	     try { /* Protein */
		 var uniprot = item.claims.P352[0].mainsnak.datavalue.value;
		 bioschemasAnnotation = {
	             "@context" : "https://schema.org",
	             "@type" : "Protein" ,
	             "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/Protein/0.11-RELEASE/" },
	             "identifier" : "Q62852" ,
	             "url" : "http://www.wikidata.org/entity/Q62852" ,
	             "sameAs": "https://www.uniprot.org/uniprot/" + uniprot
		 }
		 if ('en' in item.labels) {
	       bioschemasAnnotation.name = item.labels.en.value;
         }
		 $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
	     } catch(e) { console.log("Exception: " + e)
	     }
	 } else if (item.claims.P351 || item.claims.P594) { // NCBI Gene or Ensembl
	     try { /* Gene */
		 bioschemasAnnotation = {
	             "@context" : "https://schema.org",
	             "@type" : "Gene" ,
	             "http://purl.org/dc/terms/conformsTo": { "@type": "CreativeWork", "@id": "https://bioschemas.org/profiles/Gene/0.7-RELEASE/" },
	             "identifier" : "Q62852" ,
	             "url" : "http://www.wikidata.org/entity/Q62852"
		 }
		 if ('en' in item.labels) {
	       bioschemasAnnotation.name = item.labels.en.value;
         }
		 counter = 0
		 bioschemasAnnotation.sameAs = []
		 if (item.claims.P351 && item.claims.P351[0].mainsnak.datavalue) {
	             var ncbi = item.claims.P351[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.sameAs[counter] = "https://www.ncbi.nlm.nih.gov/gene/" + ncbi;
	             counter++
		 }
		 if (item.claims.P594 && item.claims.P594[0].mainsnak.datavalue) {
	             var ensembl = item.claims.P594[0].mainsnak.datavalue.value;
	             bioschemasAnnotation.sameAs[counter] = "http://identifiers.org/ensembl/" + ensembl;
		 }
		 $( '#bioschemas' ).append( JSON.stringify(bioschemasAnnotation) );
	     } catch(e) { console.log("Exception: " + e)
	     }
	 }
	 
	 /* English Wikipedia */
	 if ('enwiki' in item.sitelinks) {
	     var title = item.sitelinks.enwiki.title;
	     var wikipediaApiUrl = 'https://en.wikipedia.org/api/rest_v1/page/summary/' +
				   encodeURIComponent(title);
	     var wikipediaUrl = 'https://en.wikipedia.org/wiki/' + encodeURIComponent(title)

	     var headers = new Headers({"Api-User-Agent": "https://github.com/WDscholia/scholia"});

	     fetch(wikipediaApiUrl, {method: 'GET', headers: headers})
	     .then(response => response.json())
	     .then(data => {
	       var html = " (<a href=\"" + wikipediaUrl + "\">Read more on English Wikipedia</a>)";
		 $("#intro").text(data.extract).append(html);
	     }).catch(error => {
		 console.error('Error:', error);
	     });
	 }

	 
	 /* English Wikiversity */
	 if ('enwikiversity' in item.sitelinks) {
	     var enwikiversityTitle = item.sitelinks.enwikiversity.title;
	     var wikiversityApiUrl = 'https://en.wikiversity.org/w/api.php?' +
				     'action=query&prop=extracts&exsentences=3&exlimit=1&exintro=1&' + 
				     'explaintext=1&callback=?&format=json&titles=' +
				     encodeURIComponent(enwikiversityTitle);
	     var wikiversityUrl = 'https://en.wikiversity.org/wiki/' + encodeURIComponent(enwikiversityTitle)

	     $.getJSON(wikiversityApiUrl, function(data) {
		 var pages = data.query.pages;
		 var text = pages[Object.keys(pages)[0]].extract; 
		 if (text) {
		     var html = "... (from the <a href=\"" + wikiversityUrl + "\">English Wikiversity</a>)";
		 }
		 else {
		     var html = "Read on the <a href=\"" + wikiversityUrl + "\">English Wikiversity</a>";
		 }
		 $("#wikiversity-extract").text(text).append(html);
	     }).fail(function(d, textStatus, error) {
		 console.error("getJSON failed, status: " + textStatus + ", error: "+error)
	     });
	 }

     });
	
     // this query opens the Wikidata item as a different aspect
     var endpointUrl = 'https://query.wikidata.org/sparql';
     var query = `
    SELECT DISTINCT ?aspect 
    WHERE {
    { [] wdt:P50 wd:Q62852 . BIND("author" AS ?aspect) }
    UNION 
    { [] wdt:P166 wd:Q62852 . BIND("award" AS ?aspect) }
    UNION 
    { [] wdt:P17 wd:Q62852 . BIND("country" AS ?aspect) }
    UNION
    { [] wdt:P972 wd:Q62852 . BIND("catalogue" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P159? / wdt:P625 [] . BIND("location" AS ?aspect) } 
    UNION 
    { [] wdt:P1416 | wdt:P108 wd:Q62852 . BIND("organization" AS ?aspect) }
    UNION 
    { [] wdt:P123 wd:Q62852 . BIND("publisher" AS ?aspect) }
    UNION 
    { [] wdt:P872 wd:Q62852 . BIND("printer" AS ?aspect) }
    UNION 
    { [] wdt:P179 wd:Q62852 . BIND("series" AS ?aspect) }
    UNION 
    { [] wdt:P859 wd:Q62852 . BIND("sponsor" AS ?aspect) }
    UNION
    { [] wdt:P921 wd:Q62852 . BIND("topic" AS ?aspect) }
    UNION
    { [] wdt:P4510 wd:Q62852 . BIND("use" AS ?aspect) } 
    UNION
    { [] wdt:P1433 wd:Q62852 . BIND("venue" AS ?aspect) } 
    UNION
    { wd:Q62852 wdt:P235 [] . BIND("chemical" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P225 [] . BIND("taxon" AS ?aspect) }
    UNION
    { wd:Q62852 ^wdt:P31/wdt:P235 [] . BIND("chemical-class" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P644 [] . BIND("gene" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P31 / wdt:P279?  wd:Q22325163 . BIND("complex" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P31 wd:Q8054 . BIND("protein" AS ?aspect) }
    UNION
    { wd:Q62852 wdt:P50 | wdt:P2093 [] . BIND("work" AS ?aspect) }
    }
    `;
     settings = {
	 headers: { Accept: 'application/sparql-results+json' },
	 data: { query: query }
     };

     $.ajax( endpointUrl, settings ).then( function ( data ) {
	 data.results.bindings.forEach(function(entry) {
	     var aspect = entry.aspect.value;
	     $( '#aspect-chooser' ).append(
		 `<a role="button"
		     class="btn btn-outline-dark btn-sm"
                     href="/` + aspect + '/' + 'Q62852' + '">' + aspect + '</a> ' );
	 });
     } );

     // this query opens a subpage for the Wikidata item, e.g. as cito subpage
     var endpointUrl = 'https://query.wikidata.org/sparql';
     var query = `
    SELECT DISTINCT ?aspectsubpage
    WHERE {
    { [] pq:P3712 / wdt:P31 wd:Q96471816 ; ps:P2860 / wdt:P1433 wd:Q62852 . BIND("venue-cito" AS ?aspectsubpage) }
    UNION
    { [] pq:P3712 / wdt:P31 wd:Q96471816 ; ps:P2860 wd:Q62852 . BIND("work-cito" AS ?aspectsubpage) }
    }
    `;
     settings = {
	 headers: { Accept: 'application/sparql-results+json' },
	 data: { query: query }
     };

     $.ajax( endpointUrl, settings ).then( function ( data ) {
	 data.results.bindings.forEach(function(entry) {
	     var props = entry.aspectsubpage.value.split("-");
	     var aspect = props[0];
	     var subpage = props[1];
	     $( '#aspect-chooser' ).append(
		 `<a role="button"
		     class="btn btn-outline-dark btn-sm"
                     href="/` + aspect + '/' + 'Q62852' + '/' + subpage + '">' + subpage + '</a> ' );
	 });
     } );


     /* Wembedder */
     var wembedderUrl = "https://wembedder.toolforge.org/api/most-similar/Q62852";
     $.ajax({
	 url: wembedderUrl,
	 success: function (data) {
	     var html = `<hr><span data-toogle="tooltip" title="Related items from Wembedder knowledge graph embedding.">Related:</span> `; 
	     $( '#wembedder' ).append(html);

	     // Make list with results
	     data.most_similar.forEach(function(entry, idx, array) {
		 var listed_q = entry.item;
		 var language = 'en';

		 if (idx !== 0) {
		     $( '#wembedder' ).append( ' &middot; ');
		 }

		 var html = '<a href="../' + listed_q + '"><span id="wembedder-result-' + listed_q + '">' + listed_q + '</span></a> '
		 $( '#wembedder' ).append( html );

		 // Convert Q identifier to labels
                 $.getJSON("https://www.wikidata.org/w/api.php?callback=?", {
                     action: "wbgetentities",
                     ids: listed_q,
                     language: language,
                     uselang: language,
                     format: "json",
                     strictlanguage: true,
                 }, function (data) {
                     if (listed_q in data.entities) {
                         label = entityToLabel(data.entities[listed_q],
                                               language=language);
                         $('#wembedder-result-' + listed_q).empty();
                         $('#wembedder-result-' + listed_q).text(label);
                     }
		 });
	     });
	     $( '#wembedder' ).append( '<hr>' );
	 }
     });
  

 $(document).ready(function () {
     let search_text = ""
     $('#searchterm').select2({
         allowClear: true,
         
         placeholder: "Search...",
         
         ajax: {
             url: "https://www.wikidata.org/w/api.php?callback=?",
             dataType: 'jsonp',
             data: function (params) {
                 search_text = params.term
                 var query = {
                     search: params.term,
                     action: "wbsearchentities",
                     language: "en",
                     uselang: "en",
                     format: "json",
                     strictlanguage: true
                 }
                 return query
             },
             processResults: function (data) {
                 var results = [{id: -1, text: "Advanced search"}];
                 $.each(data.search, function (index, item) {
                     results.push({
                         id: "/" + item.title,
                         text: item.label + " - " + item.description
                     });
                 });

                 return {
                     "results": results
                 };
             }
         }
     });

     $("#searchterm").on("select2:select", function (e) {
         const search_id = e.params.data.id
         if (search_id === -1) {
             if(search_text === undefined) search_text = ""
             window.location.href = "/search?q=" + search_text;
         } else {
             window.location.href = e.params.data.id;
         }
     });

     // Add anchor links to all headings
     var headers = document.querySelectorAll('h2[id], h3[id]')
     if (headers) {
       headers.forEach(element => {
         var title = element.innerText;
         element.removeChild(element.childNodes[0])
         element.insertAdjacentHTML('afterbegin', `<a href="#${element.id}" class="hlink"  ariaLabel="Anchor">${title}</a>`)
       })
     }

     // Add table of content
  var headings = document.querySelectorAll("h2,h3");
  if (headings.length >= 4) {
    var toc = document.createElement("div");
    toc.className = "table-of-contents"

    tocTitle = document.createElement("b");
    tocTitle.innerText = "Table of Contents"
    toc.appendChild(tocTitle)

    var tocList = document.createElement("ul");
    var sublist = "";
    for (let i = 0; i < headings.length; i++) {
      const element = headings[i];
      if (!element.id) {
        element.id = element.innerText.replace(" ", "-")
      }
      if (element.tagName === "H3" && !sublist) {
        var sublist = document.createElement("ul");
      }
      tocListItem = document.createElement("li");

      tocEntry = document.createElement("a");
      tocEntry.setAttribute("href", "#" + element.id);
      tocEntry.innerText = headings[i].innerText;

      tocListItem.appendChild(tocEntry);

      if (element.tagName === "H3") {
        sublist.appendChild(tocListItem);
        if (i == headings.length - 1) {
          tocList.appendChild(sublist);
        }
      } else {
        if (sublist) {
          tocList.appendChild(sublist);
          sublist = "";
        }
        tocList.appendChild(tocListItem);
      }
    }

    toc.appendChild(tocList)
    document.querySelector("h2").insertAdjacentElement("beforebegin", toc)
  }


     

// list-of-publications table
sparqlToDataTable(`# tool: scholia
#defaultView:Table
SELECT
  (MIN(?dates) AS ?date)
  ?work ?workLabel
  (GROUP_CONCAT(DISTINCT ?type_label; separator=", ") AS ?type)
  (SAMPLE(?pages_) AS ?pages)
  ?venue ?venueLabel
  (GROUP_CONCAT(DISTINCT ?author_label; separator=", ") AS ?authors)
  (CONCAT("../authors/", GROUP_CONCAT(DISTINCT SUBSTR(STR(?author), 32); separator=",")) AS ?authorsUrl)
WHERE {
  ?work wdt:P50 wd:Q62852 .
  ?work wdt:P50 ?author .
  OPTIONAL {
    ?author rdfs:label ?author_label_ . FILTER (LANG(?author_label_) = 'en')
  }
  BIND(COALESCE(?author_label_, SUBSTR(STR(?author), 32)) AS ?author_label)
  OPTIONAL { ?work wdt:P31 ?type_ . ?type_ rdfs:label ?type_label . FILTER (LANG(?type_label) = 'en') }
  ?work wdt:P577 ?datetimes .
  BIND(xsd:date(?datetimes) AS ?dates)
  OPTIONAL { ?work wdt:P1104 ?pages_ }
  OPTIONAL { ?work wdt:P1433 ?venue }
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,no,ru,sv,zh". }  
}
GROUP BY ?work ?workLabel ?venue ?venueLabel
ORDER BY DESC(?date)  
`,
"#list-of-publications-table", "author_list-of-publications.sparql",
options={});
// venue-statistics table
sparqlToDataTable(`# tool: scholia
# Venue statistics for a specific author
SELECT
  ?count (SAMPLE(?short_name_) AS ?short_name)
  ?venue ?venueLabel
  ?topics ?topicsUrl
WITH {
  SELECT
    (COUNT(DISTINCT ?work) as ?count)
    ?venue
    (GROUP_CONCAT(DISTINCT ?topic_label; separator=", ") AS ?topics)
    (CONCAT("../topics/", GROUP_CONCAT(DISTINCT SUBSTR(STR(?topic), 32); separator=",")) AS ?topicsUrl)
  WHERE {
    ?work wdt:P50 wd:Q62852 .
    ?work wdt:P1433 ?venue .
    OPTIONAL {
      ?venue wdt:P921 ?topic .
      ?topic rdfs:label ?topic_label . FILTER(LANG(?topic_label) = 'en') }
  }
  GROUP BY ?venue
} AS %result
WHERE {
  INCLUDE %result
  OPTIONAL { ?venue wdt:P1813 ?short_name_ . }
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh". }  
} 
GROUP BY ?count ?venue ?venueLabel ?topics ?topicsUrl
ORDER BY DESC(?count)
`,
"#venue-statistics-table", "author_venue-statistics.sparql",
options={});
// review-statistics table
sparqlToDataTable(`# tool: scholia
# Venue statistics for a specific reviewer
SELECT
  ?count (SAMPLE(?short_name_) AS ?short_name)
  ?venue ?venueLabel
  ?topics ?topicsUrl
WITH {
  SELECT
    (COUNT(DISTINCT ?work) as ?count)
    ?venue
    (GROUP_CONCAT(DISTINCT ?topic_label; separator=", ") AS ?topics)
    (CONCAT("../topics/", GROUP_CONCAT(DISTINCT SUBSTR(STR(?topic), 32); separator=",")) AS ?topicsUrl)
  WHERE {
    ?work wdt:P4032 wd:Q62852 .
    ?work wdt:P1433 ?venue .
    OPTIONAL {
      ?venue wdt:P921 ?topic .
      ?topic rdfs:label ?topic_label . FILTER(LANG(?topic_label) = 'en') }
  }
  GROUP BY ?venue
} AS %result
WHERE {
  INCLUDE %result
  OPTIONAL { ?venue wdt:P1813 ?short_name_ . }
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh". }  
} 
GROUP BY ?count ?venue ?venueLabel ?topics ?topicsUrl
ORDER BY DESC(?count)
`,
"#review-statistics-table", "author_review-statistics.sparql",
options={});
// topics table
sparqlToDataTable(`# tool: scholia
#defaultView:Table
SELECT ?count ?theme ?themeLabel ?example_work ?example_workLabel
WITH {
  SELECT (COUNT(?work) AS ?count) ?theme (SAMPLE(?work) AS ?example_work)
  WHERE {
    ?work wdt:P50 wd:Q62852 .
    ?work wdt:P921 ?theme .
  }
  GROUP BY ?theme
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count) 
`,
"#topics-table", "author_topics.sparql",
options={});
// most-cited-works table
sparqlToDataTable(`# tool: scholia
#defaultView:Table
# Author's most cited works
SELECT ?count ?work ?workLabel 
WITH {
  SELECT (count(?citing_work) as ?count) ?work WHERE {
    ?work wdt:P50 wd:Q62852 .
    OPTIONAL { ?citing_work wdt:P2860 ?work . }
  }
  GROUP BY ?work
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,jp". }        
}  
ORDER BY DESC(?count)
LIMIT 500
`,
"#most-cited-works-table", "author_most-cited-works.sparql",
options={});
// most-citing-authors table
sparqlToDataTable(`# tool: scholia
#defaultView:Table
SELECT
  ?count
  ?citing_author ?citing_authorLabel

  # Either show the ORCID iD or construct part of a URL to search on the ORCID homepage
  (COALESCE(?orcid_, CONCAT("orcid-search/quick-search/?searchQuery=", ENCODE_FOR_URI(?citing_authorLabel))) AS ?orcid)
WITH {
  SELECT (COUNT(?citing_work) AS ?count) ?citing_author WHERE {
    ?work wdt:P50 wd:Q62852 .
    ?citing_work wdt:P2860 ?work . 
    MINUS { ?citing_work wdt:P50 wd:Q62852 }
    ?citing_work wdt:P50 ?citing_author .
  }
  GROUP BY ?citing_author 
  ORDER BY DESC(?count)
  LIMIT 500
} AS %counts
WITH {
  # An author might have multiple ORCID iDs
  SELECT
    ?count
    ?citing_author
    (SAMPLE(?orcids) AS ?orcid_)
  WHERE {
    INCLUDE %counts
    OPTIONAL { ?citing_author wdt:P496 ?orcids }
  }
  GROUP BY ?count ?citing_author
} AS %result
WHERE {
  INCLUDE %result
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh". }
} 
ORDER BY DESC(?count)
`,
"#most-citing-authors-table", "author_most-citing-authors.sparql",
options={});
// events table
sparqlToDataTable(`# tool: scholia
SELECT
  (xsd:date(MIN(?start)) AS ?date)  
  ?event
  ?eventLabel
  (GROUP_CONCAT(DISTINCT ?role; separator=", ") AS ?roles)
  (GROUP_CONCAT(DISTINCT ?location_label; separator=", ") AS ?locations)
WHERE {
    BIND(wd:Q62852 AS ?person)
    {  # speaker
      ?event wdt:P823 ?person .
      BIND("speaker" AS ?role)
    } UNION {  # organizer
      ?event wdt:P664 ?person .
      BIND("organizer" AS ?role)
    } UNION {  # participant
      ?person wdt:P1344 | ^wdt:P710 ?event  .
      BIND("participant" AS ?role)
    } UNION {  # editor
      ?person ^wdt:P98 / wdt:P4745 ?event  .
      BIND("editor of proceedings" AS ?role)
    } UNION {  # author
      ?person ^wdt:P50 / wdt:P1433 / wdt:P4745 ?event  .
      BIND("author" AS ?role)
    } UNION {  # program committee member
      ?event wdt:P5804 ?person .
      BIND("program committee member" AS ?role)
    }
    OPTIONAL { ?event wdt:P276 ?location . ?location rdfs:label ?location_label . FILTER (LANG(?location_label) = 'en')}
    OPTIONAL { ?event wdt:P580 | wdt:P585 ?start }
 
    SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en,da,de,es,fr,jp,no,ru,sv,zh". }
}
GROUP BY ?event ?eventLabel
ORDER BY DESC(?date) 
`,
"#events-table", "author_events.sparql",
options={"linkPrefixes": {"event": "../event/"}});
// publications-per-year iframe
sparqlToIframe(`# tool: scholia
#defaultView:BarChart
# Inspired from LEGOLAS - http://abel.lis.illinois.edu/legolas/
# Shubhanshu Mishra, Vetle Torvik
select ?year (count(?work) as ?number_of_publications) ?role where {
  {
    select (str(?year_) as ?year) (0 as ?pages) ("_" as ?role) where {
      # default values = 0
      ?year_item wdt:P31 wd:Q577 . 
      ?year_item wdt:P585 ?date .
      bind(year(?date) as ?year_)
      {
        select (min(?year_) as ?earliest_year)  (max(?year_) as ?latest_year) where {
          ?work wdt:P50 wd:Q62852 .
          ?work wdt:P577 ?publication_date . 
          bind(year(?publication_date) as ?year_)
        }
      }
      bind(year(now())+1 as ?next_year)
      filter (?year_ >= ?earliest_year && ?year_ <= ?latest_year)
    }
  }
  union {
  {
    select ?work (min(?years) as ?year) (count(?coauthors) as ?number_of_authors) ?author_number where {
      ?work (p:P50|p:P2093) ?author_statement . 
      ?author_statement ps:P50 wd:Q62852 .
      optional { ?author_statement pq:P1545 ?author_number . }
      ?work (wdt:P50|wdt:P2093) ?coauthors . 
      ?work wdt:P577 ?dates .
      bind(str(year(?dates)) as ?years) .
    }
    group by ?work ?author_number
  }
  bind(coalesce(if(?number_of_authors = 1,
            'Solo author',
            if(xsd:integer(?author_number) = 1,
               'First author',
               if(xsd:integer(?author_number) = ?number_of_authors,
                  'Last author',
                  'Middle author'))), 'Unknown')
       as ?role)
   }
}
group by ?year ?role
order by ?year`,
"#publications-per-year-iframe", "author_publications-per-year.sparql");
// pages-per-year iframe
sparqlToIframe(`# tool: scholia
#defaultView:BarChart
select ?year ?number_of_pages ?work_label where {
  {
    select ?year (sample(?pages) as ?number_of_pages) ?work_label where {
      {
        select (str(?year_) as ?year) (0 as ?pages) ("_" as ?work_label) where {
          ?year_item wdt:P31 wd:Q577 . 
          ?year_item wdt:P585 ?date .
          bind(year(?date) as ?year_)
          {
            select (min(?year_) as ?earliest_year) (max(?year_) as ?latest_year) where {
              ?work wdt:P50 wd:Q62852 .
              ?work wdt:P577 ?publication_date . 
              bind(year(?publication_date) as ?year_)
            }
          }
          filter (?year_ >= ?earliest_year && ?year_ <= ?latest_year)
        }
      }
      union {
        ?work wdt:P50 wd:Q62852 .
        ?work wdt:P1104 ?pages .
        ?work wdt:P577 ?date . 
        ?work rdfs:label ?long_work_label . filter(lang(?long_work_label) = 'en')
        bind(substr(?long_work_label, 1, 20) as ?work_label)
        bind(str(year(?date)) as ?year) 
      }
	} 
	group by ?year ?work ?work_label
	order by ?year 
  }
}`,
"#pages-per-year-iframe", "author_pages-per-year.sparql");
// topic-scores iframe
sparqlToIframe(`# tool: scholia
#defaultView:BubbleChart
SELECT ?score ?topic ?topicLabel
WITH {
  SELECT
    (SUM(?score_) AS ?score)
    ?topic
  WHERE {
    { 
      wd:Q62852 wdt:P101 ?topic .
      BIND(20 AS ?score_)
    }
    UNION
    {
      SELECT (3 AS ?score_) ?topic WHERE {
        ?work wdt:P50 wd:Q62852 ;
              wdt:P921 ?topic . 
      }
    }
    UNION
    {
      SELECT (1 AS ?score_) ?topic WHERE {
        ?work wdt:P50 wd:Q62852 .
        ?citing_work wdt:P2860 ?work .
        ?citing_work wdt:P921 ?topic . 
      }
    }
  }
  GROUP BY ?topic
} AS %results 
WHERE {
  INCLUDE %results
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en,da,de,es,jp,no,ru,sv,zh". }
}
ORDER BY DESC(?score)
LIMIT 200`,
"#topic-scores-iframe", "author_topic-scores.sparql");
// venue-statistics-chart iframe
sparqlToIframe(`# tool: scholia
#defaultView:BubbleChart
SELECT ?count ?venue (SAMPLE(?venue_label_) AS ?venue_label) 
WITH {
  SELECT (COUNT(?work) as ?count) ?venue WHERE {
    ?work wdt:P50 wd:Q62852 .
    ?work wdt:P1433 ?venue .
  }
  GROUP BY ?venue
} AS %counts
WHERE {
  INCLUDE %counts
  ?venue rdfs:label ?long_venue_label FILTER(LANG(?long_venue_label) = 'en')
  OPTIONAL { ?venue wdt:P1813 ?short_name . }
  BIND(COALESCE(?short_name, ?long_venue_label) AS ?venue_label_)
}
GROUP BY ?venue ?count
ORDER BY DESC(?count)  `,
"#venue-statistics-chart-iframe", "author_venue-statistics-chart.sparql");
// coauthors iframe
sparqlToIframe(`# tool: scholia
#defaultView:Graph
# Egocentric co-author graph for an author
SELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label
WITH {
  SELECT (COUNT(?work) AS ?count) ?author1 ?author2 WHERE {
    # Find co-authors
    ?work wdt:P50 wd:Q62852, ?author1, ?author2 .

    # Filtering 
    # Only journal and conference articles, books, not (yet?) software
    # VALUES ?publication_type { wd:Q13442814 wd:Q571 wd:Q26973022}  
    # ?work wdt:P31 ?publication_type .
  }
  GROUP BY ?author1 ?author2
  ORDER BY DESC(?count)
                    
  # Limit the size of the graph, to avoid overburdening the browser
  LIMIT 1000
} AS %authors
WITH {
  SELECT ?author1 ?author2 ?rgb WHERE {
    INCLUDE %authors
    
    # Exclude self-links
    FILTER (?author1 != ?author2)
    
    # Color according to gender
    OPTIONAL {
      ?author1 wdt:P21 ?gender1 . 
      BIND( IF(?gender1 = wd:Q6581097, "3182BD", "E6550D") AS ?rgb)
    }
  }
} AS %result
WHERE {
  INCLUDE %result
  # Label the results 
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,fr,de,ru,es,zh,jp". }
}`,
"#coauthors-iframe", "author_coauthors.sparql");
// coauthor-map iframe
sparqlToIframe(`# tool: scholia
PREFIX target: <http://www.wikidata.org/entity/Q62852>

#defaultView:Map
SELECT ?organization ?organizationLabel ?geo ?count ?layer
WITH {
  SELECT DISTINCT ?organization ?geo (COUNT(DISTINCT ?work) AS ?count) WHERE {
    ?work wdt:P50 target: ;
          wdt:P50 ?author .
    FILTER (?author != target: )
    ?author ( wdt:P108 | wdt:P463 | wdt:P1416 ) / wdt:P361* ?organization . 
    ?organization wdt:P625 ?geo .
  }
  GROUP BY ?organization ?geo ?count
  ORDER BY DESC (?count)
  LIMIT 2000
} AS %organizations
WHERE {
  INCLUDE %organizations
  BIND(IF( (?count < 1), "No results", IF((?count < 2), "1 result", IF((?count < 5), "1 < results â‰¤ 10", IF((?count < 101), "10 < results â‰¤ 100", IF((?count < 1001), "100 < results â‰¤ 1000", IF((?count < 10001), "1000 < results â‰¤ 10000", "10000 or more results") ) ) ) )) AS ?layer )
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }        
 }
ORDER BY DESC (?count)
`,
"#coauthor-map-iframe", "author_coauthor-map.sparql");
// other-locations iframe
sparqlToIframe(`# tool: scholia
#defaultView:Map
SELECT DISTINCT ?image ?item ?itemLabel ?geo (?property_item_label AS ?layer)
WHERE {
  wd:Q62852 ?property ?item . 
  ?item p:P159/pq:P625 | wdt:P276*/wdt:P625 ?geo .
  ?property_item wikibase:directClaim ?property .
  OPTIONAL { ?item wdt:P18 ?image . } 
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh". }
  
  # No automatic labeling on the property, - for some reason.
  ?property_item rdfs:label ?property_item_label . FILTER(LANG(?property_item_label) = 'en')
}`,
"#other-locations-iframe", "author_other-locations.sparql");
// timeline iframe
sparqlToIframe(`# tool: scholia
#defaultView:Timeline
# Timeline for an author
SELECT ?label ?beginning ?ending ?education_degree_label
WITH {
  SELECT ?work (MIN(?publication_date) AS ?beginning) WHERE {
    ?work wdt:P50 wd:Q62852 .
    ?work wdt:P577 ?publication_date . 
  }
  GROUP BY ?work
} AS %works_with_publication_date
WITH {
  
  SELECT ?work ?beginning (COUNT(?citing_article) AS ?number_of_citations) WHERE {
    INCLUDE %works_with_publication_date
    OPTIONAL { ?citing_article wdt:P2860 ?work . }
  }
  GROUP BY ?work ?beginning 
} AS %works
WHERE {
  # { Birth wd:Q62852 wdt:P569 ?beginning . BIND("Birth" AS ?label) } UNION
  {
    { 
      SELECT ?work ?beginning WHERE {
        INCLUDE %works
      }
      ORDER BY DESC(?number_of_citations)
      LIMIT 1        
    }
    BIND("ðŸ“– publication of most cited article" AS ?label)
  }
  UNION
  {
    { 
      SELECT ?work ?beginning WHERE {
        INCLUDE %works
      }
      ORDER BY ?beginning
      LIMIT 1        
    }
    BIND("ðŸ“– first publication" AS ?label)
  }
  UNION
  {
    { 
      SELECT ?work ?beginning WHERE {
        INCLUDE %works
      }
      ORDER BY DESC(?beginning)
      LIMIT 1        
    }
    BIND("ðŸ“– latest publication" AS ?label)
  }
  UNION
  {
    # Education
    wd:Q62852 p:P69 ?education_statement .
    ?education_statement ps:P69 ?education .
    ?education rdfs:label ?education_label . 
    FILTER (lang(?education_label) = 'en')
    BIND(CONCAT("ðŸ¦‰ ", ?education_label) AS ?label)
    OPTIONAL { ?education_statement pq:P580 ?beginning . }
    OPTIONAL { ?education_statement pq:P582 ?ending . }
    OPTIONAL {
      ?education_statement pq:P512 ?education_degree . 
      ?education_degree rdfs:label ?education_degree_label .
      FILTER (lang(?education_degree_label) = 'en')
    }
  }
  UNION
  {
    # Affiliation
    wd:Q62852 p:P1416 | p:P108 ?affiliation_statement .
    ?affiliation_statement ps:P1416 | ps:P108 ?affiliation .
    ?affiliation rdfs:label ?affiliation_label .
    FILTER (lang(?affiliation_label) = 'en')
    BIND(CONCAT("ðŸ  ",?affiliation_label) AS ?label)
    # OPTIONAL { ?affiliation wdt:P18 ?image }
    OPTIONAL { ?affiliation_statement pq:P580 ?beginning . }
    OPTIONAL { ?affiliation_statement pq:P582 ?ending . }
    OPTIONAL {
      ?affiliation_statement pq:P512 ?affiliation_degree . 
      ?affiliation_degree rdfs:label ?affiliation_degree_label .
      FILTER (lang(?affiliation_degree_label) = 'en')
    }
  }
  UNION
  {
    wd:Q62852 p:P166 ?award_statement . 
    ?award_statement ps:P166 ?award .
    ?award rdfs:label ?award_label .
    FILTER (lang(?award_label) = 'en')
    BIND(CONCAT("ðŸ† ",?award_label) AS ?label)
    ?award_statement pq:P585 ?beginning .
  }

} `,
"#timeline-iframe", "author_timeline.sparql");
// academic-tree iframe
sparqlToIframe(`# tool: scholia
#defaultView:Graph
# Doctoral student/advisor network with a source from a spectific researcher
PREFIX gas: <http://www.bigdata.com/rdf/gas#>

SELECT DISTINCT ?student1 ?student1Label ?rgb ?supervisor1 ?supervisor1Label
WHERE {
  { 
    SELECT ?student1 ?supervisor1 (MIN(?depth1) as ?depth)
    WHERE {
      SERVICE gas:service {
        gas:program gas:gasClass "com.bigdata.rdf.graph.analytics.BFS" ;
                gas:in wd:Q62852 ; 
                gas:traversalDirection "Forward" ;
                gas:out ?student1 ;
                gas:out1 ?depth1 ;
                gas:out2 ?supervisor1 ;
                gas:linkType wdt:P185 ;
      }
    }
    GROUP BY ?student1 ?supervisor1
  }
  UNION
  { 
    SELECT ?student1 ?supervisor1 (MIN(?depth1) as ?depth)
    WHERE {
      service gas:service {
        gas:program gas:gasClass "com.bigdata.rdf.graph.analytics.BFS" ;
                gas:in wd:Q62852 ; 
                gas:traversalDirection "Forward" ;
                gas:out ?supervisor1 ;
                gas:out1 ?depth1 ;
                gas:out2 ?student1 ;
                gas:linkType wdt:P184 ;
      }
    }
    GROUP BY ?student1 ?supervisor1
  }
  UNION
  { 
    SELECT ?student1 ?supervisor1 (MIN(?depth1) as ?depth)
    WHERE {
      SERVICE gas:service {
        gas:program gas:gasClass "com.bigdata.rdf.graph.analytics.BFS" ;
                gas:in wd:Q62852 ; 
                gas:traversalDirection "Reverse" ;
                gas:out ?student1 ;
                gas:out1 ?depth1 ;
                gas:out2 ?supervisor1 ;
                gas:linkType wdt:P184 ;
      }
    }
    GROUP BY ?student1 ?supervisor1
  }
  UNION
  { 
    SELECT ?student1 ?supervisor1 (MIN(?depth1) as ?depth)
    WHERE {
      SERVICE gas:service {
        gas:program gas:gasClass "com.bigdata.rdf.graph.analytics.BFS" ;
                gas:in wd:Q62852 ; 
                gas:traversalDirection "Reverse" ;
                gas:out ?supervisor1 ;
                gas:out1 ?depth1 ;
                gas:out2 ?student1 ;
                gas:linkType wdt:P185 ;
      }
    }
    GROUP BY ?student1 ?supervisor1
  }
  
  BIND( IF( ?student1 = wd:Q62852, "3080BB", "ffffff") AS ?rgb)  

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,sv,jp,zh,ru,fr,de" .  } 
}
`,
"#academic-tree-iframe", "author_academic-tree.sparql");
// citations-by-year iframe
sparqlToIframe(`# tool: scholia
#defaultView:BarChart
SELECT ?year (count(distinct ?citing_work) as ?count) ?kind  WHERE {
  ?work wdt:P50 wd:Q62852 .
  ?citing_work wdt:P2860 ?work .
  bind(if (exists { ?citing_work wdt:P50 wd:Q62852 }, "self-citations", "citations from others") as ?kind)
  ?citing_work wdt:P577 ?date .
  BIND(str(YEAR(?date)) AS ?year)
} group by ?year ?kind
order by desc(?year)`,
"#citations-by-year-iframe", "author_citations-by-year.sparql");
// associated-images iframe
sparqlToIframe(`# tool: scholia
#defaultView:ImageGrid
SELECT DISTINCT ?image WHERE {
  {
    # Images of the person
    wd:Q62852 wdt:P18 ?image .
  }
  UNION {
    # Images from whatever property value is linked.
    
    # Excluded "different from" property and take all other properties
    wd:Q62852 !wdt:P1889 ?item .

    ?item wdt:P18 ?image . 
    
    # All people are humans, so these images are excluded.
    FILTER (?item != wd:Q5)
  }
  UNION {
    # Images associated with works of the author, both direct images,
    # images of topics of the works and images of coauthors.
    wd:Q62852 ^wdt:P50 / (wdt:P921* | wdt:P50) / wdt:P18 ?image .
  }
}   `,
"#associated-images-iframe", "author_associated-images.sparql");

// topics-works-matrix matrix
sparqlToMatrix(`# tool: scholia
SELECT ?work ?workLabel ?topic ?topicLabel WHERE {
?work wdt:P50 wd:Q62852 .
?work wdt:P921 ?topic .
OPTIONAL { ?work wdt:P577 ?publication_date }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en,cz,da,de,es,fr,hi,jp,nl,nn,ru,sv,zh". }
}
ORDER BY ?publication_date`,
"#topics-works-matrix", "author_topics-works-matrix.sparql");



 });

</script>


  </body>
</html>
